print('________________________________________')
print("1. Задание: 'Длина слова.'")
print("Фраза: Добрый вечер")
print("Ответ:", len("Добрый вечер")) #12
print('________________________________________')
print("2. Задание: 'Суммы и разности.'")
print('1 число = 23, 2 число = 16')
first = 23
second = 16
summa = first + second
diff = first - second
print("Ответ:")
print("Сумма:", summa)
print("Разность:", diff)
print('________________________________________')
print("3. Задание: 'Среднее арифметическое.'")
print('1 число = 23, 2 число = 16, 3 число = 2')
first = 23
second = 16
third = 2
mean = (first + second + third) // 3
print("Ответ:")
print("Среднее арифметическое:", mean)
print('________________________________________')
print("4. Задание: 'Простые строчки.'")
first_string = "Вторник"
second_string = "Понедельник"
print("Ответ:")
print(second_string, ", ", first_string)
print('________________________________________')
print("5. Задание: 'Сложная формула.'")
print('1 число = 23, 2 число = 16, 3 число = 2')
print("Дано: ((23*16)+(23*2))^3*2")
a = 23
b = 16
c = 2
f = (a * b) + (a * c)
d = f ** 3
i = d // 2
print("Ответ:")
print(i)
print('________________________________________')
print("Практическое задание по уроку 'Базовые структуры данных' выполнено")